In [6]:
import pandas as pd
movies = open("movie.csv")
movies.readlines

In [11]:
movies = pd.read_csv("movie.csv")
movies.tail()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
4911,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
4912,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
4913,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
4914,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
4915,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [15]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

Homework 1
1. Rename column names using function. "First Name" --> "first_name", "Age" --> "age
2. Print the first 3 rows of the DataFrame
3. Find the mean age of the individuals
4. Select and print only the 'Name' and 'City' columns
5. Add a new column 'Salary' with random salary values
6. Display summary statistics of the DataFrame

In [16]:
# 1. Rename column names using function. "First Name" --> "first_name", "Age" --> "age
new_column = {"First Name": "first_name", "Age":"age"}
df.rename(columns=new_column)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [18]:
# 2. Print the first 3 rows of the DataFrame
df.head(n=3)

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [19]:
# 3. Find the mean age of the individuals
avarage_age = df['Age']
avarage_age.mean()

np.float64(32.5)

In [22]:
# 4. Select and print only the 'Name' and 'City' columns
df[['First Name', 'City']]

  First Name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [23]:
# 5. Add a new column 'Salary' with random salary values
df['Salary'] = [10000,20000,30000,35000]
df

  First Name  Age           City  Salary
0      Alice   25       New York   10000
1        Bob   30  San Francisco   20000
2    Charlie   35    Los Angeles   30000
3      David   40        Chicago   35000

In [26]:
# 6. Display summary statistics of the DataFrame
df.describe(include='all')

       First Name        Age      City        Salary
count           4   4.000000         4      4.000000
unique          4        NaN         4           NaN
top         Alice        NaN  New York           NaN
freq            1        NaN         1           NaN
mean          NaN  32.500000       NaN  23750.000000
std           NaN   6.454972       NaN  11086.778913
min           NaN  25.000000       NaN  10000.000000
25%           NaN  28.750000       NaN  17500.000000
50%           NaN  32.500000       NaN  25000.000000
75%           NaN  36.250000       NaN  31250.000000
max           NaN  40.000000       NaN  35000.000000

1. Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data.

In [27]:
data = {
    'Month': ['Janouary', 'February', 'March', 'April'],
    'Sales': [5000, 6000, 7500, 8000],
    'Expenses': [3000, 3500, 4000, 4500],
}
dataframe = pd.DataFrame(data)
dataframe

      Month  Sales  Expenses
0  Janouary   5000      3000
1  February   6000      3500
2     March   7500      4000
3     April   8000      4500

In [28]:
# 2. Calculate and display the maximum sales and expenses.
max_sales = dataframe['Sales'].max()
max_expenses = dataframe['Expenses'].max()

print(f"Maximum Sales: {max_sales}")
print(f"Maximum Expenses: {max_expenses}")

Maximum Sales: 8000
Maximum Expenses: 4500

In [29]:
# 3. Calculate and display the minimum sales and expenses.
min_sales = dataframe['Sales'].min()
min_expenses = dataframe['Expenses'].min()

print(f"Minimum Sales: {min_sales}")
print(f"Minimum Expenses: {min_expenses}")

Minimum Sales: 5000
Minimum Expenses: 3000

In [30]:
# 4. Calculate and display the average sales and expenses.
avg_sales = dataframe['Sales'].mean()
avg_expenses = dataframe['Expenses'].mean()

print(f"Avarage Sales: {avg_sales}")
print(f"Avarage Expenses: {avg_expenses}")

Avarage Sales: 6625.0
Avarage Expenses: 3750.0

Homework 3:

1. Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.

2. Calculate and display the maximum expense for each category.
3. Calculate and display the minimum expense for each category.
4. Calculate and display the average expense for each category.

In this task, use `.set_index` method to make Category column as index. 

Try this code, learn it and use it in the task.

> expenses.set_index('Category')

In [31]:
hw3_data = {
    'Categpry': ['Rent', 'Utilities', 'Groceries', 'Entertaiment'],
    'January' : [1200, 200,300,150],
    'Fabruary' : [1300, 220,320,160],
    'March' : [1400, 240,330,170],
    'April' : [1500, 250,350,180]
}
hw3 = pd.DataFrame(hw3_data)
hw3

       Categpry  January  Fabruary  March  April
0          Rent     1200      1300   1400   1500
1     Utilities      200       220    240    250
2     Groceries      300       320    330    350
3  Entertaiment      150       160    170    180

In [ ]:
# 2. Calculate and display the maximum expense for each category.
max_exp = hw3.max()
max_exp

Categpry    Utilities
January          1200
Fabruary         1300
March            1400
April            1500
dtype: object

In [36]:
# 3. Calculate and display the minimum expense for each category.
min_exp = hw3.min()
min_exp

Categpry    Entertaiment
January              150
Fabruary             160
March                170
April                180
dtype: object

In [58]:
# 4. Calculate and display the average expense for each category.
# hw3.set_index('Categpry', inplace=True)
average_expenses = hw3.mean(axis=1)
print(average_expenses)

Categpry
Rent            1350.0
Utilities        227.5
Groceries        325.0
Entertaiment     165.0
dtype: float64